Hom-Wang/NRF5x/NRF51_TestRTC/Program/Drives/nrf51_rtc.c
/*=====================================================================================================*/
/*=====================================================================================================*/
#include "nrf51_system.h"
#include "nrf51_clock.h"
#include "nrf51_rtc.h"
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_Config
**功能 : RTC Config
**輸入 : None
**輸出 : None
**使用 : RTC_Config();
**====================================================================================================*/
/*====================================================================================================*/
void RTC_Config( void )
{
  CLOCK_SourceLFCLK(CLOCK_LFCLKSRC_SRC_RC);
  CLOCK_CmdLFCLK(ENABLE);

  NRF_RTC0->PRESCALER = 327;  // F_RTC = 32.768kHz / (327 + 1) ~ 100Hz
  NRF_RTC0->CC[0]     = 100;  // 1s

  NRF_RTC0->EVTENSET = RTC_EVTENSET_TICK_Msk | RTC_EVTENSET_COMPARE0_Msk;
  NRF_RTC0->INTENSET = RTC_INTENSET_TICK_Msk | RTC_INTENSET_COMPARE0_Msk;

  NVIC_EnableIRQ(RTC0_IRQn);

  RTC_Cmd(ENABLE);
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_CntClear
**功能 : Counter Clear
**輸入 : NewState
**輸出 : None
**使用 : RTC_Cmd(ENABLE);
**====================================================================================================*/
/*====================================================================================================*/
void RTC_Cmd( FunctionalState NewState )
{
  if(NewState == SUCCESS)
    NRF_RTC0->TASKS_START = 1;
  else
    NRF_RTC0->TASKS_STOP = 1;
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_CntClear
**功能 : Counter Clear
**輸入 : None
**輸出 : None
**使用 : RTC_CntClear();
**====================================================================================================*/
/*====================================================================================================*/
void RTC_CntClear( void )
{
  NRF_RTC0->TASKS_CLEAR = 1;
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_TickEvenCheck
**功能 : Tick Even Check
**輸入 : None
**輸出 : State
**使用 : State = RTC_TickEvenCheck();
**====================================================================================================*/
/*====================================================================================================*/
u8 RTC_TickEvenCheck( void )
{
  return ((NRF_RTC0->EVENTS_TICK == 1) ? SUCCESS : ERROR);
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_TickEvenClear
**功能 : Tick Even Clear
**輸入 : None
**輸出 : None
**使用 : RTC_TickEvenClear();
**====================================================================================================*/
/*====================================================================================================*/
void RTC_TickEvenClear( void )
{
  NRF_RTC0->EVENTS_TICK = 0;
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_CompEvenCheck
**功能 : RTC CC Even Check
**輸入 : RTC_CH
**輸出 : State
**使用 : State = RTC_CompEvenCheck(RTC_CH0);
**====================================================================================================*/
/*====================================================================================================*/
u8 RTC_CompEvenCheck( RTC_CH_TypeDef RTC_CH )
{
  return ((NRF_RTC0->EVENTS_COMPARE[RTC_CH] == 1) ? SUCCESS : ERROR);
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_CompEvenClear
**功能 : RTC CC Even Clear
**輸入 : RTC_CH
**輸出 : State
**使用 : RTC_CompEvenClear(RTC_CH0);
**====================================================================================================*/
/*====================================================================================================*/
void RTC_CompEvenClear( RTC_CH_TypeDef RTC_CH )
{
  NRF_RTC0->EVENTS_COMPARE[RTC_CH] = 0;
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_TickEnenCmd
**功能 : Enable / Disable Tick Even
**輸入 : NewState
**輸出 : None
**使用 : RTC_TickEnenCmd(ENABLE);
**====================================================================================================*/
/*====================================================================================================*/
//void RTC_TickEnenCmd( FunctionalState NewState )
//{
//  if(NewState == ENABLE)
//    NRF_RTC0->EVTENSET = RTC_EVTENSET_TICK_Enabled << RTC_EVTENSET_TICK_Pos;
//  else
//    NRF_RTC0->EVTENCLR = RTC_EVTENCLR_TICK_Enabled << RTC_EVTENCLR_TICK_Pos;
//}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : RTC_TickIntCmd
**功能 : Enable / Disable Tick Interrupt
**輸入 : NewState
**輸出 : None
**使用 : RTC_TickIntCmd();
**====================================================================================================*/
/*====================================================================================================*/
//void RTC_TickIntCmd( FunctionalState NewState )
//{
//  if(NewState == ENABLE)
//    NRF_RTC0->INTENSET = RTC_INTENSET_TICK_Enabled << RTC_INTENSET_TICK_Pos;
//  else
//    NRF_RTC0->INTENCLR = RTC_INTENCLR_TICK_Enabled << RTC_INTENCLR_TICK_Pos;
//}
/*=====================================================================================================*/
/*=====================================================================================================*/
